---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotAddAlreadyMemberToDiffGroup
source: html/12988e0c-92ff-627d-0d72-5252629cd8d8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotAddAlreadyMemberToDiffGroup Property

Elements that are already members of one group cannot be added to another group.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAddAlreadyMemberToDiffGroup { get; }
```